DataProcessors/КонтрольТемпературы1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>КонтрольТемпературы1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовторенияСервер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовторенияКлиент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДатчика1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТемператураДатчика1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДатчика2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТемператураДатчика2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДатчика3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТемператураДатчика3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДатчика4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТемператураДатчика4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВлажностьДатчика4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВлажностьДатчика4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаАктивнаАвтоматикаОсновногоОбогревателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаМинТемператураОсновногоОбогревателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаМаксТемператураОсновногоОбогревателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаАктивнаАвтоматикаАКБОбогревателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаМинТемператураАКБОбогревателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаМаксТемператураАКБОбогревателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реле1Вкл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеле1Вкл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реле2Вкл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеле2Вкл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реле3Вкл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеле3Вкл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реле4Вкл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеле4Вкл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинРеле1НагревательОсновной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинРеле2НагревательДополнительный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинРеле3НагревательАКБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинРеле4Свет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинДатчикТемпературы1MF52</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинДатчикТемпературы2MF52</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинДатчикТемпературы3MF52</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинДатчикТемпературы4DHT21</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеСопротивленияТемпературыТерморезитораMF52</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сопротивление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Температура</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/КонтрольТемпературы1/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПроцессДляСервера(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИтерацию(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказанияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьПоказанияМодульОбъекта(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказания(Команда)
	ОбновитьПоказанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле1ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле1НагревательОсновной, ?(Объект.Реле1Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле1Вкл(Команда)
	Реле1ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле2ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле2НагревательДополнительный, ?(Объект.Реле2Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле2Вкл(Команда)
	Реле2ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле3ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле3НагревательАКБ, ?(Объект.Реле3Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле3Вкл(Команда)
	Реле3ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле4ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле4Свет, ?(Объект.Реле4Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле4Вкл(Команда)
	Реле4ВклНаСервере();      
КонецПроцедуры

&НаСервере
Процедура ИнициализацияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Инициализация(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Инициализация(Команда)
	ИнициализацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущиеДанныеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьТекущиеДанные(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущиеДанные(Команда)
	ПолучитьТекущиеДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИзСправочникаНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ЗаполнитьНастройки(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Объект.Сообщения = Объект.Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиИзСправочника(Команда)
	ПрочитатьНастройкиИзСправочникаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеНастройкиНаСервере(ИмяРеквизита)
	НайстрокаВСправочнике = Объект.Оборудование.Настройки.Найти("Реквизиты", "Наименование");
	Если НайстрокаВСправочнике <> Неопределено Тогда 
		НастройкаОбъект = НайстрокаВСправочнике.Настройка.ПолучитьОбъект();		
		ТабНастроек = НастройкаОбъект.ТаблицаНастроек;		
		СтрСПараметром = ТабНастроек.Найти(ИмяРеквизита, "Параметр");
		Если СтрСПараметром = Неопределено Тогда //Добавляем
			СтрСПараметром = ТабНастроек.Добавить();
			СтрСПараметром.Параметр = ИмяРеквизита;
		КонецЕсли;
		СтрСПараметром.Значение = Объект[ИмяРеквизита];
		НастройкаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменениеНастройки(Элемент)
	ЗаписатьИзменениеНастройкиНаСервере(Элемент.Имя);
КонецПроцедуры
